Revit 2027 API
PanelScheduleTemplate.HasSameType Method
 Checks if given template has the same panel schedule type with this template.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasSameType(
	PanelScheduleTemplate otherTemplate
)
Public Function HasSameType (
	otherTemplate As PanelScheduleTemplate
) As Boolean
public:
bool HasSameType(
	PanelScheduleTemplate^ otherTemplate
)
member HasSameType :
        otherTemplate : PanelScheduleTemplate -> bool
Parameters
otherTemplate PanelScheduleTemplate
 The given template to check.
Return Value
Boolean
 True if the given template has the same panel schedule type with this template, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The panel schedule type is the enum type of PanelScheduleType class (Branch, switchboard, data etc.)
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace